# Задание 1

a = int(input("Введите натуральное число от 1 до 100: ")) 
print("Для каждого числа от 1 до", a, "квадрат и куб числа: ")
for i in range (1, a+1):
    print(i, "->", i ** 2, i ** 3)